/*
Navicat MySQL Data Transfer

Source Server         : mysql
Source Server Version : 50512
Source Host           : localhost:3306
Source Database       : fly

Target Server Type    : MYSQL
Target Server Version : 50512
File Encoding         : 65001

Date: 2023-04-07 21:34:28
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `admin`
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uq1` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('1', 'admin', 'admin', 'admin');

-- ----------------------------
-- Table structure for `announcement`
-- ----------------------------
DROP TABLE IF EXISTS `announcement`;
CREATE TABLE `announcement` (
  `aid` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL,
  `mark` varchar(5000) DEFAULT NULL,
  `dates` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`aid`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of announcement
-- ----------------------------
INSERT INTO `announcement` VALUES ('1', '关于CH航空网站系统升级的公告', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-01-01 11:11:11');
INSERT INTO `announcement` VALUES ('2', '关于西双版纳机场国内航站楼值机办理区域调整的通知', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-01-01 11:11:12');
INSERT INTO `announcement` VALUES ('3', '关于受广深及华东区域雷雨天气影响部分CH航空航班调整的温馨提示', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-01-01 11:11:13');
INSERT INTO `announcement` VALUES ('4', '关于海口往返中国香港航线的温馨提示', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-01-01 11:11:14');
INSERT INTO `announcement` VALUES ('5', 'CH航空控股股份有限公司公告', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-01-01 11:11:15');
INSERT INTO `announcement` VALUES ('6', '关于海口美兰国际机场T2航站楼国际区域启用的通知', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-01-01 11:11:16');
INSERT INTO `announcement` VALUES ('7', '关于西双版纳机场国内航站楼值机办理区域调整的通知', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-01-01 11:11:17');
INSERT INTO `announcement` VALUES ('8', '关于海口往返中国香港航线的温馨提示', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-01-01 11:11:18');
INSERT INTO `announcement` VALUES ('9', '关于受广深及华东区域雷雨天气影响部分CH航空航班调整的温馨提示', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-01-01 11:11:18');
INSERT INTO `announcement` VALUES ('10', '关于海口美兰国际机场T2航站楼国际区域启用的通知', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-01-01 11:11:20');
INSERT INTO `announcement` VALUES ('11', 'CH航空控股股份有限公司公告', '特殊需求旅客：婴儿摇篮仅适用于国际航线宽体机，已预订婴儿摇篮的旅客（限一人）可免费被安排在额外腿部空间付费座位，无需支付额外费用，请拨打CH航空24小时订票服务热线99999申请。<br/>\r\n预选紧急出口排座位的旅客需是符合民航运输安全规定的非特殊人群，同时还需符合海南航空安全运营管理标准。<br/>\r\n（1）不适用于未满15周岁或超过65周岁的旅客；<br/>\r\n（2）不适用于体重超过100KG、身高190CM 以上或明显的肥胖旅客；<br/>\r\n（3）在发生紧急情况时，愿意提供协助；<br/>\r\n（4）具备阅读能力和理解印刷或图片形式的能力，在发生紧急情况时能执行机组人员指示；<br/>\r\n（5）因旅客自身原因导致不符合就座紧急出口，可在机场直属售票处办理退款。<br/>\r\n您可以通过海南航空官方网站或海南航空APP预订免费座位，我们会尽量为您保留您选定的座位。由于机型变更可能会导致您提前预订的座位变更或丢失，如若您的行程改期、票号变更，原预订座位信息将被取消，请您及时登录海南航空官方网站或CH航空APP留意您的座位预订信息。座位位置请以最终办理乘机手续的座位为准。<br/>\r\n由于航班配载平衡等安全原因，为保证飞行安全，前排座位可能被锁定以至无法提前选座，敬请谅解。<br/>\r\n免费座位：<br/>\r\n（1）国内机票在航班起飞前1小时之前可以办理提前选座，适用舱位（C、D、Z、I、J、R、W、E、Y、B、H、K、L、M、X、Q、P、V、N、G、S、O）；惠选经济舱（A、U、T）不能提前选座。<br/>\r\n（2）国际机票在航班起飞前1小时之前可以办理提前选座，无舱位限制。<br/>\r\n（1）付费座位适用航线及价格，请见适用条件请点击此处查看；<br/>\r\n（2）金鹏会员旅客不能使用透支积分兑换产品，且无法为受益人兑换产品；<br/>\r\n（3）航班起飞前48小时之前（含），国际航线选座产品可在原购买渠道办理退款。航班起飞前24小时之前（含），国内航线选座产品可在原购买渠道办理退款，不收取费用；国际航线选座产品在航班起飞前48小时以内及航班起飞后，国内航线选座产品在航班起飞前24小时以内及航班起飞后，不可办理改期、签转、退款（旅客自身原因导致不符合就座于紧急出口及不正常航班保障除外）<br/>\r\n（4）如因行程改期、票号变更，机型变更等原因，原预订座位被取消，付费座位可通过原购买渠道办理退款，并可重新预订座位。<br/>\r\n温馨提示：部分789机型包含超级经济舱，31-33排座位属于超经舱座位，不支持付费或积分兑换，仅支持付费升舱。34排对应普通经济舱第一排（31排）。<br/>\r\n温馨提示：部分789机型包含舒适经济舱，31-34排座位属于额外腿部空间座位，支持付费或积分兑换。<br/>\r\n因机型不同，氧气面罩的分布也不同，请携带婴儿出游的旅客到柜台办理值机选座业务。<br/>\r\n仅适用于880票证海航实际承运航班客票的服务预订，不支持非880票证客票预订。<br/>', '2023-04-07 21:21:20');

-- ----------------------------
-- Table structure for `fly`
-- ----------------------------
DROP TABLE IF EXISTS `fly`;
CREATE TABLE `fly` (
  `fid` int(11) NOT NULL AUTO_INCREMENT,
  `fly_name` varchar(255) DEFAULT NULL,
  `fly_card` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `start_city` varchar(255) DEFAULT NULL,
  `end_city` varchar(255) DEFAULT NULL,
  `start_address` varchar(255) DEFAULT NULL,
  `end_address` varchar(255) DEFAULT NULL,
  `start_time` varchar(255) DEFAULT NULL,
  `end_time` varchar(255) DEFAULT NULL,
  `duration` varchar(255) DEFAULT NULL,
  `business_old` int(11) DEFAULT NULL,
  `business_new` int(11) DEFAULT NULL,
  `economy_old` int(11) DEFAULT NULL,
  `economy_new` int(11) DEFAULT NULL,
  `eat` varchar(255) DEFAULT NULL,
  `fly_status` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`fid`)
) ENGINE=InnoDB AUTO_INCREMENT=80 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of fly
-- ----------------------------
INSERT INTO `fly` VALUES ('1', 'CH航空', 'CH 7267', '空客333', '北京', '重庆', '北京首都国际机场T2航站楼', '重庆江北国际机场航站楼T3航站楼', '20:00', '22:55', '2h55m', '2060', '1980', '1000', '950', '点心', '启用');
INSERT INTO `fly` VALUES ('2', 'CH航空', 'CH 7167', '空客333', '北京', '广州', '北京首都国际机场T2航站楼', '广州白云机场T1航站楼', '19:30', '22:50', '3h20m', '2400', '2090', '1000', '900', '无餐食', '关闭');
INSERT INTO `fly` VALUES ('3', 'CH航空', 'CH 7809', '波音789', '北京', '广州', '北京首都国际机场T2航站楼', '广州白云机场T1航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '920', '晚餐', '启用');
INSERT INTO `fly` VALUES ('4', 'CH航空', 'CH 7613', '波音738', '北京', '上海', '北京首都国际机场T2航站楼', '上海浦东国际机场T2航站楼', '20:30', '22:45', '2h15m', '1850', '1750', '710', '610', '点心', '启用');
INSERT INTO `fly` VALUES ('5', 'CH航空', 'CH 7605', '空客332', '北京', '上海', '北京首都国际机场T2航站楼', '上海虹桥机场T2航站楼', '15:30', '17:40', '2h10m', '3230', '2910', '1200', '800', '晚餐', '启用');
INSERT INTO `fly` VALUES ('6', 'CH航空', 'HU 7135', '波音789', '北京', '重庆', '北京首都国际机场T2航站楼', '重庆江北国际机场T3航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '850', '晚餐', '启用');
INSERT INTO `fly` VALUES ('7', 'CH航空', 'CH 7267', '空客333', '重庆', '北京', '重庆江北国际机场航站楼T3', '北京首都国际机场T2航站楼', '20:00', '22:55', '2h55m', '2060', '1980', '1000', '960', '点心', '启用');
INSERT INTO `fly` VALUES ('8', 'CH航空', 'CH 7167', '空客333', '广州', '北京', '广州白云机场T1航站楼', '北京首都国际机场T2航站楼', '19:30', '22:50', '3h20m', '2400', '2090', '1000', '980', '无餐食', '启用');
INSERT INTO `fly` VALUES ('9', 'CH航空', 'CH 7809', '波音789', '广州', '北京', '广州白云机场T1航站楼', '北京首都国际机场T2航站楼', '20:30', '23:50', '3h20m', '2300', '2150', '1000', '920', '无餐食', '启用');
INSERT INTO `fly` VALUES ('10', 'CH航空', 'CH 7613', '波音738', '上海', '北京', '上海浦东国际机场T2航站楼', '北京首都国际机场T2航站楼', '21:30', '23:45', '2h15m', '3230', '2910', '1200', '910', '点心', '启用');
INSERT INTO `fly` VALUES ('11', 'CH航空', 'CH 7605', '空客332', '上海', '北京', '上海虹桥机场T2航站楼', '北京首都国际机场T2航站楼', '15:30', '17:40', '2h10m', '2060', '1980', '1000', '900', '晚餐', '启用');
INSERT INTO `fly` VALUES ('12', 'CH航空', 'HU 7135', '波音789', '重庆', '北京', '重庆江北国际机场T3航站楼', '北京首都国际机场T2航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '850', '晚餐', '启用');
INSERT INTO `fly` VALUES ('13', 'CH航空', 'CH 7267', '空客333', '北京', '深圳', '北京首都国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '20:00', '22:55', '2h55m', '2060', '1980', '1000', '920', '点心', '启用');
INSERT INTO `fly` VALUES ('14', 'CH航空', 'CH 7167', '空客333', '北京', '深圳', '北京首都国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '922', '无餐食', '启用');
INSERT INTO `fly` VALUES ('15', 'CH航空', 'CH 7809', '波音789', '北京', '深圳', '北京首都国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '930', '晚餐', '启用');
INSERT INTO `fly` VALUES ('16', 'CH航空', 'CH 7613', '波音738', '北京', '海口', '北京首都国际机场T2航站楼', '海口国际机场航站楼T1航站楼', '07:30', '09:45', '2h15m', '1850', '1750', '710', '610', '早餐', '启用');
INSERT INTO `fly` VALUES ('17', 'CH航空', 'CH 7605', '空客332', '北京', '海口', '北京首都国际机场T2航站楼', '海口国际机场航站楼T1航站楼', '15:30', '17:40', '2h10m', '3230', '2910', '1200', '850', '晚餐', '启用');
INSERT INTO `fly` VALUES ('18', 'CH航空', 'HU 7135', '波音789', '北京', '海口', '北京首都国际机场T2航站楼', '海口国际机场航站楼T1航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '980', '晚餐', '启用');
INSERT INTO `fly` VALUES ('19', 'CH航空', 'CH 7267', '空客333', '三亚', '北京', '三亚国际机场T2航站楼', '北京首都国际机场T2航站楼', '20:00', '22:55', '2h55m', '2060', '1980', '1000', '970', '点心', '启用');
INSERT INTO `fly` VALUES ('20', 'CH航空', 'CH 7167', '空客333', '三亚', '北京', '三亚国际机场T2航站楼', '北京首都国际机场T2航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '820', '无餐食', '启用');
INSERT INTO `fly` VALUES ('21', 'CH航空', 'CH 7809', '波音789', '三亚', '北京', '三亚国际机场T2航站楼', '北京首都国际机场T2航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '750', '无餐食', '启用');
INSERT INTO `fly` VALUES ('22', 'CH航空', 'CH 7613', '波音738', '杭州', '北京', '杭州国际机场T2航站楼', '北京首都国际机场T2航站楼', '07:30', '09:45', '2h15m', '3230', '2910', '1200', '680', '早餐', '启用');
INSERT INTO `fly` VALUES ('23', 'CH航空', 'CH 7605', '空客332', '杭州', '北京', '杭州国际机场T2航站楼', '北京首都国际机场T2航站楼', '15:30', '17:40', '2h10m', '2060', '1980', '1000', '900', '晚餐', '启用');
INSERT INTO `fly` VALUES ('24', 'CH航空', 'HU 7135', '波音789', '杭州', '北京', '杭州国际机场T2航站楼', '北京首都国际机场T2航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '780', '晚餐', '启用');
INSERT INTO `fly` VALUES ('25', 'CH航空', 'CH 7267', '空客333', '西安', '深圳', '西安国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '08:00', '10:55', '2h55m', '2060', '1980', '1000', '860', '点心', '启用');
INSERT INTO `fly` VALUES ('26', 'CH航空', 'CH 7167', '空客333', '西安', '深圳', '西安国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '960', '无餐食', '启用');
INSERT INTO `fly` VALUES ('27', 'CH航空', 'CH 7809', '波音789', '西安', '深圳', '西安国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '860', '晚餐', '启用');
INSERT INTO `fly` VALUES ('28', 'CH航空', 'CH 7613', '波音738', '深圳', '海口', '深圳国际机场航站楼T3航站楼', '海口国际机场航站楼T1航站楼', '07:30', '09:45', '2h15m', '1850', '1750', '710', '610', '早餐', '启用');
INSERT INTO `fly` VALUES ('29', 'CH航空', 'CH 7605', '空客332', '深圳', '海口', '深圳国际机场航站楼T3航站楼', '海口国际机场航站楼T1航站楼', '15:30', '17:40', '2h10m', '3230', '2910', '1200', '960', '晚餐', '启用');
INSERT INTO `fly` VALUES ('30', 'CH航空', 'HU 7135', '波音789', '深圳', '海口', '深圳国际机场航站楼T3航站楼', '海口国际机场航站楼T1航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '790', '晚餐', '启用');
INSERT INTO `fly` VALUES ('31', 'CH航空', 'CH 7267', '空客333', '西安', '北京', '西安国际机场T2航站楼', '北京首都国际机场T2航站楼', '08:00', '10:55', '2h55m', '2060', '1980', '1000', '899', '点心', '启用');
INSERT INTO `fly` VALUES ('32', 'CH航空', 'CH 7167', '空客333', '西安', '北京', '西安国际机场T2航站楼', '北京首都国际机场T2航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '699', '无餐食', '启用');
INSERT INTO `fly` VALUES ('33', 'CH航空', 'CH 7809', '波音789', '西安', '北京', '西安国际机场T2航站楼', '北京首都国际机场T2航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '960', '无餐食', '启用');
INSERT INTO `fly` VALUES ('34', 'CH航空', 'CH 7613', '波音738', '成都', '北京', '成都国际机场T2航站楼', '北京首都国际机场T2航站楼', '07:30', '09:45', '2h15m', '3230', '2910', '1200', '980', '早餐', '启用');
INSERT INTO `fly` VALUES ('35', 'CH航空', 'CH 7605', '空客332', '成都', '北京', '成都国际机场T2航站楼', '北京首都国际机场T2航站楼', '15:30', '17:40', '2h10m', '2060', '1980', '1000', '900', '晚餐', '启用');
INSERT INTO `fly` VALUES ('36', 'CH航空', 'HU 7135', '波音789', '成都', '北京', '成都国际机场T2航站楼', '北京首都国际机场T2航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '915', '晚餐', '启用');
INSERT INTO `fly` VALUES ('37', 'CH航空', 'CH 7268', '空客333', '北京', '重庆', '北京首都国际机场T2航站楼', '重庆江北国际机场航站楼T3航站楼', '08:00', '10:55', '2h55m', '2060', '1980', '1000', '925', '点心', '启用');
INSERT INTO `fly` VALUES ('38', 'CH航空', 'CH 7168', '空客333', '北京', '广州', '北京首都国际机场T2航站楼', '广州白云机场T1航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '960', '无餐食', '启用');
INSERT INTO `fly` VALUES ('39', 'CH航空', 'CH 7808', '波音789', '北京', '广州', '北京首都国际机场T2航站楼', '广州白云机场T1航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '935', '晚餐', '启用');
INSERT INTO `fly` VALUES ('40', 'CH航空', 'CH 7616', '波音738', '北京', '上海', '北京首都国际机场T2航站楼', '上海浦东国际机场T2航站楼', '07:30', '09:45', '2h15m', '1850', '1750', '710', '610', '早餐', '启用');
INSERT INTO `fly` VALUES ('41', 'CH航空', 'CH 7606', '空客332', '北京', '上海', '北京首都国际机场T2航站楼', '上海虹桥机场T2航站楼', '15:30', '17:40', '2h10m', '3230', '2910', '1200', '960', '晚餐', '启用');
INSERT INTO `fly` VALUES ('42', 'CH航空', 'HU 7136', '波音789', '北京', '重庆', '北京首都国际机场T2航站楼', '重庆江北国际机场T3航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '895', '晚餐', '启用');
INSERT INTO `fly` VALUES ('43', 'CH航空', 'CH 7266', '空客333', '重庆', '北京', '重庆江北国际机场航站楼T3', '北京首都国际机场T2航站楼', '08:00', '10:55', '2h55m', '2060', '1980', '1000', '850', '点心', '启用');
INSERT INTO `fly` VALUES ('44', 'CH航空', 'CH 7166', '空客333', '广州', '北京', '广州白云机场T1航站楼', '北京首都国际机场T2航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '960', '无餐食', '启用');
INSERT INTO `fly` VALUES ('45', 'CH航空', 'CH 7808', '波音789', '广州', '北京', '广州白云机场T1航站楼', '北京首都国际机场T2航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '888', '无餐食', '启用');
INSERT INTO `fly` VALUES ('46', 'CH航空', 'CH 7616', '波音738', '上海', '北京', '上海浦东国际机场T2航站楼', '北京首都国际机场T2航站楼', '07:30', '09:45', '2h15m', '3230', '2910', '1200', '980', '早餐', '启用');
INSERT INTO `fly` VALUES ('47', 'CH航空', 'CH 7606', '空客332', '上海', '北京', '上海虹桥机场T2航站楼', '北京首都国际机场T2航站楼', '15:30', '17:40', '2h10m', '2060', '1980', '1000', '900', '晚餐', '启用');
INSERT INTO `fly` VALUES ('48', 'CH航空', 'HU 7136', '波音789', '重庆', '北京', '重庆江北国际机场T3航站楼', '北京首都国际机场T2航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '960', '晚餐', '启用');
INSERT INTO `fly` VALUES ('49', 'CH航空', 'CH 7266', '空客333', '北京', '深圳', '北京首都国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '08:00', '10:55', '2h55m', '2060', '1980', '1000', '940', '点心', '启用');
INSERT INTO `fly` VALUES ('50', 'CH航空', 'CH 7166', '空客333', '北京', '深圳', '北京首都国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '960', '无餐食', '启用');
INSERT INTO `fly` VALUES ('51', 'CH航空', 'CH 7806', '波音789', '北京', '深圳', '北京首都国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '800', '晚餐', '启用');
INSERT INTO `fly` VALUES ('52', 'CH航空', 'CH 7616', '波音738', '北京', '海口', '北京首都国际机场T2航站楼', '海口国际机场航站楼T1航站楼', '07:30', '09:45', '2h15m', '1850', '1750', '710', '610', '早餐', '启用');
INSERT INTO `fly` VALUES ('53', 'CH航空', 'CH 7606', '空客332', '北京', '海口', '北京首都国际机场T2航站楼', '海口国际机场航站楼T1航站楼', '15:30', '17:40', '2h10m', '3230', '2910', '1200', '788', '晚餐', '启用');
INSERT INTO `fly` VALUES ('54', 'CH航空', 'HU 7136', '波音789', '北京', '海口', '北京首都国际机场T2航站楼', '海口国际机场航站楼T1航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '790', '晚餐', '启用');
INSERT INTO `fly` VALUES ('55', 'CH航空', 'CH 7266', '空客333', '三亚', '北京', '三亚国际机场T2航站楼', '北京首都国际机场T2航站楼', '08:00', '10:55', '2h55m', '2060', '1980', '1000', '899', '点心', '启用');
INSERT INTO `fly` VALUES ('56', 'CH航空', 'CH 7166', '空客333', '三亚', '北京', '三亚国际机场T2航站楼', '北京首都国际机场T2航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '955', '无餐食', '启用');
INSERT INTO `fly` VALUES ('57', 'CH航空', 'CH 7806', '波音789', '三亚', '北京', '三亚国际机场T2航站楼', '北京首都国际机场T2航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '965', '无餐食', '启用');
INSERT INTO `fly` VALUES ('58', 'CH航空', 'CH 7616', '波音738', '杭州', '北京', '杭州国际机场T2航站楼', '北京首都国际机场T2航站楼', '20:30', '22:45', '2h15m', '3230', '2910', '1200', '980', '无餐食', '启用');
INSERT INTO `fly` VALUES ('59', 'CH航空', 'CH 7606', '空客332', '杭州', '北京', '杭州国际机场T2航站楼', '北京首都国际机场T2航站楼', '15:30', '17:40', '2h10m', '2060', '1980', '1000', '900', '晚餐', '启用');
INSERT INTO `fly` VALUES ('60', 'CH航空', 'HU 7136', '波音789', '杭州', '北京', '杭州国际机场T2航站楼', '北京首都国际机场T2航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '950', '晚餐', '启用');
INSERT INTO `fly` VALUES ('61', 'CH航空', 'CH 7266', '空客333', '西安', '深圳', '西安国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '20:00', '22:55', '2h55m', '2060', '1980', '1000', '980', '点心', '启用');
INSERT INTO `fly` VALUES ('62', 'CH航空', 'CH 7166', '空客333', '西安', '深圳', '西安国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '919', '无餐食', '启用');
INSERT INTO `fly` VALUES ('63', 'CH航空', 'CH 7806', '波音789', '西安', '深圳', '西安国际机场T2航站楼', '深圳国际机场航站楼T3航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '960', '晚餐', '启用');
INSERT INTO `fly` VALUES ('64', 'CH航空', 'CH 7616', '波音738', '深圳', '海口', '深圳国际机场航站楼T3航站楼', '海口国际机场航站楼T1航站楼', '20:30', '22:45', '2h15m', '1850', '1750', '710', '610', '点心', '启用');
INSERT INTO `fly` VALUES ('65', 'CH航空', 'CH 7606', '空客332', '深圳', '海口', '深圳国际机场航站楼T3航站楼', '海口国际机场航站楼T1航站楼', '15:30', '17:40', '2h10m', '3230', '2910', '1200', '799', '晚餐', '启用');
INSERT INTO `fly` VALUES ('66', 'CH航空', 'HU 7136', '波音789', '深圳', '海口', '深圳国际机场航站楼T3航站楼', '海口国际机场航站楼T1航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '900', '晚餐', '启用');
INSERT INTO `fly` VALUES ('67', 'CH航空', 'CH 7266', '空客333', '西安', '北京', '西安国际机场T2航站楼', '北京首都国际机场T2航站楼', '20:00', '22:55', '2h55m', '2060', '1980', '1000', '599', '点心', '启用');
INSERT INTO `fly` VALUES ('68', 'CH航空', 'CH 7166', '空客333', '西安', '北京', '西安国际机场T2航站楼', '北京首都国际机场T2航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '899', '无餐食', '启用');
INSERT INTO `fly` VALUES ('69', 'CH航空', 'CH 7806', '波音789', '西安', '北京', '西安国际机场T2航站楼', '北京首都国际机场T2航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1000', '960', '无餐食', '启用');
INSERT INTO `fly` VALUES ('70', 'CH航空', 'CH 7616', '波音738', '成都', '北京', '成都国际机场T2航站楼', '北京首都国际机场T2航站楼', '07:30', '09:45', '2h15m', '3230', '2910', '1200', '799', '早餐', '启用');
INSERT INTO `fly` VALUES ('71', 'CH航空', 'CH 7606', '空客332', '成都', '北京', '成都国际机场T2航站楼', '北京首都国际机场T2航站楼', '15:30', '17:40', '2h10m', '2060', '1980', '1000', '900', '晚餐', '启用');
INSERT INTO `fly` VALUES ('72', 'CH航空', 'HU 7136', '波音789', '成都', '北京', '成都国际机场T2航站楼', '北京首都国际机场T2航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '890', '晚餐', '启用');
INSERT INTO `fly` VALUES ('73', 'CH航空', 'CH 7613', '波音738', '北京', '杭州', '北京首都国际机场T2航站楼', '杭州国际机场T2航站楼', '07:30', '09:45', '2h15m', '3230', '2910', '1200', '680', '早餐', '启用');
INSERT INTO `fly` VALUES ('74', 'CH航空', 'CH 7605', '空客332', '北京', '杭州', '北京首都国际机场T2航站楼', '杭州国际机场T2航站楼', '20:30', '22:40', '2h10m', '2060', '1980', '1000', '900', '点心', '启用');
INSERT INTO `fly` VALUES ('75', 'CH航空', 'HU 7135', '波音789', '北京', '杭州', '北京首都国际机场T2航站楼', '杭州国际机场T2航站楼', '17:25', '20:15', '2h50m', '2060', '1980', '1000', '780', '晚餐', '启用');
INSERT INTO `fly` VALUES ('76', 'CH航空', 'CH 7267', '空客333', '深圳', '北京', '深圳国际机场航站楼T3航站楼', '北京首都国际机场T2航站楼', '20:00', '22:55', '2h55m', '2060', '1980', '1000', '799', '点心', '启用');
INSERT INTO `fly` VALUES ('77', 'CH航空', 'CH 7167', '空客333', '深圳', '北京', '深圳国际机场航站楼T3航站楼', '北京首都国际机场T2航站楼', '08:30', '11:50', '3h20m', '2400', '2090', '1000', '899', '无餐食', '启用');
INSERT INTO `fly` VALUES ('78', 'CH航空', 'CH 7809', '波音789', '深圳', '北京', '深圳国际机场航站楼T3航站楼', '北京首都国际机场T2航站楼', '16:30', '19:50', '3h20m', '2300', '2150', '1100', '999', '晚餐', '启用');

-- ----------------------------
-- Table structure for `msg`
-- ----------------------------
DROP TABLE IF EXISTS `msg`;
CREATE TABLE `msg` (
  `mid` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `num` varchar(255) DEFAULT NULL,
  `mark` varchar(10000) DEFAULT NULL,
  `times` varchar(255) DEFAULT NULL,
  `dates` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`mid`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of msg
-- ----------------------------
INSERT INTO `msg` VALUES ('1', '张三', '15766856895', 'C8688', '内容XXXXXXX', '2023-01-02', '2023-01-10 11:11:11');
INSERT INTO `msg` VALUES ('2', '张三', '15766856895', 'C8688', '内容XXXXXXX', '2023-01-02', '2023-01-10 11:11:11');
INSERT INTO `msg` VALUES ('3', '李四', '15766856895', 'C8688', '内容XXXXXXX', '2023-01-02', '2023-01-10 11:11:12');
INSERT INTO `msg` VALUES ('4', '王五', '15766856895', 'C8688', '内容XXXXXXX', '2023-01-02', '2023-01-10 11:11:13');
INSERT INTO `msg` VALUES ('5', '赵六', '15766856895', 'C8688', '内容XXXXXXX', '2023-01-02', '2023-01-10 11:11:14');
INSERT INTO `msg` VALUES ('6', '张三', '15766856895', 'C8688', '内容XXXXXXX', '2023-01-02', '2023-01-10 11:11:15');
INSERT INTO `msg` VALUES ('7', '张三', '15766856895', 'C8688', '内容XXXXXXX', '2023-01-02', '2023-01-10 11:11:16');
INSERT INTO `msg` VALUES ('8', '程浩', '15766856895', 'CH 2587', '机组人员很贴心 准备了点心', '2023-04-05', '2023-04-07 12:05:27');

-- ----------------------------
-- Table structure for `orders`
-- ----------------------------
DROP TABLE IF EXISTS `orders`;
CREATE TABLE `orders` (
  `oid` varchar(255) NOT NULL,
  `oname` varchar(255) DEFAULT NULL,
  `idcard` varchar(255) DEFAULT NULL,
  `ophone` varchar(255) DEFAULT NULL,
  `nationality` varchar(255) DEFAULT NULL,
  `visa` varchar(255) DEFAULT NULL,
  `price` int(11) DEFAULT NULL,
  `types` varchar(255) DEFAULT NULL,
  `dates` varchar(255) DEFAULT NULL,
  `ostatus` varchar(255) DEFAULT NULL,
  `start_date` varchar(255) DEFAULT NULL,
  `end_date` varchar(255) DEFAULT NULL,
  `useridfk` int(11) DEFAULT NULL,
  `fkyidfk` int(11) DEFAULT NULL,
  PRIMARY KEY (`oid`),
  KEY `useridfk1` (`useridfk`),
  KEY `fkyidfk1` (`fkyidfk`),
  CONSTRAINT `fkyidfk1` FOREIGN KEY (`fkyidfk`) REFERENCES `fly` (`fid`),
  CONSTRAINT `useridfk1` FOREIGN KEY (`useridfk`) REFERENCES `user` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of orders
-- ----------------------------
INSERT INTO `orders` VALUES ('16808518730201', '张倩', '210302198607160930', '15766858982', '中国', '中国', '2910', '公务舱', '2023-04-07 15:17:53', '已预订', '2023-04-08', '2023-04-08', '1', '73');
INSERT INTO `orders` VALUES ('16808544010231', '张倩', '210302198607160930', '15766858982', '中国香港', '中国澳门', '2910', '公务舱', '2023-04-07 16:00:01', '已出票', '2023-04-08', '2023-04-08', '1', '73');
INSERT INTO `orders` VALUES ('16808686149252', '刘集', '211003198407230111', '13159858785', '中国', '中国', '790', '经济舱', '2023-04-07 19:56:54', '已出票', '2023-04-08', '2023-04-08', '2', '30');
INSERT INTO `orders` VALUES ('16808686232672', '刘集', '211003198407230111', '13159858785', '中国', '中国', '1980', '公务舱', '2023-04-07 19:57:03', '已退订', '2023-04-08', '2023-04-08', '2', '55');

-- ----------------------------
-- Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `uid` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `sex` varchar(255) DEFAULT NULL,
  `age` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `card` varchar(255) DEFAULT NULL,
  `vip` varchar(255) DEFAULT NULL,
  `status` varchar(255) DEFAULT NULL,
  `integral` int(11) DEFAULT NULL,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `uq2` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', '111111', '111111', '张倩', '15766858982', '女', '20', '北京', '210302198607160930', '钻石会员', '正常', '55821');
INSERT INTO `user` VALUES ('2', '222222', '222222', '刘集', '13159858785', '男', '22', '上海', '211003198407230111', '白金会员', '正常', '13700');
INSERT INTO `user` VALUES ('3', '333333', '333333', '张三', '15989878569', '男', '28', '广东', '210303198508131214', '黄金会员', '冻结', '100');
INSERT INTO `user` VALUES ('5', '444444', '444444', '思思', '13159897847', '女', '20', '未知', '440919555448787842', '白银会员', '正常', '100');
INSERT INTO `user` VALUES ('6', '555555', '555555', '王五', '15989878569', '男', '20', '未知', '210303198508131214', '白银会员', '正常', '100');
